const products = [
  {
    id: 1,
    title: "لپتاپ 15 اینچی ایسوس مدل TUF FX505DT-HN665",
    category: "laptop",
    price: "۲۵,۰۳۰,۰۰۰",
    img: "/img/product-img/1-0.jpg",
    desc: `لپتاپ ایسوس مدل TUF FX505DT-HN665 یک لپ‌تاپ مخصوص بازی (گیمینگ) ساخت این کمپانی قدرتمند است. از ویژگی‌های این لپ‌تاپ‌ می‌توان به وجود پردازنده و کارت گرافیک به روز و قدرتمند اشاره کرد که موجب می‌شود تا گیمر به‌صورت حرفه‌ای و بسیار آسان بتواند با آن بازی کرده و از آن لذت ببرد. اندازه و ضخامت این لپ‌تاپ‌ به‌علت وجود سخت‌افزارهای نیرومند، نمایشگر بزرگ و سیستم خنک‌سازی قدرتمند، زیاد بوده و طراحی آن‌ها نیز به‌گونه‌ای است که مورد پسند گیمرها است. این لپ‌‌تاپ‌ گیمینگ به‌صورت سبک و با قابلیت نقل و انتقال آسان طراحی شده و استفاده از رنگ مشکی در قاب این مدل، شکل ویژه‌ و جذابی به دستگاه داده است. وزن لپ‌تاپ ایسوس TUF FX505DT-HN665 برای حمل در کوله یا کیف مخصوص بسیار مناسب بوده و کاربر می‌تواند بدون اذیت شدن، آن را با خود حمل کند.`,
  },
  {
    id: "2",
    title: "لپ تاپ 15.6 اینچی ایسوس مدل R565MA-BQ197",
    category: "laptop",
    price: "۱۰,۸۰۰,۰۰۰",
    img: "/img/product-img/2.jpg",
    desc: `
لپ تاپ 15.6 اینچی ایسوس مدل R565MA-BQ197 از محصولات سری «VivoBook» شرکت «ایسوس» محسوب می‌شود که با طراحی زیبا روانه‌ی بازار شده است. این لپ‌تاپ به‌واسطه‌ی قابلیت‌ها و امکاناتی که دارد، علاوه ‌بر کاربری معمول روزمره، برای کاربری مالتی‌مدیا هم مناسب است. بدنه‌ی شیک R565MA به‌گونه‌ای طراحی شده که لپ‌تاپی رده‌بالا را نوید می‌دهد. این بدنه 23 میلی‌متر ضخامت و 2 کیلوگرم وزن دارد و برای جابه‌جایی دائمی آن مشکل خاصی نخواهید داشت. صفحه‌نمایش 15.6 اینچی این محصول، پنل TFT با وضوح Full HD و روکش مات است. وجود بلندگوهای قوی ایسوس هم کاربری این لپ‌تاپ را به‌عنوان یک محصول مالتی‌مدیا تقویت می‌کند. پورت‌های متعدد و متنوعی از جمله 2 پورت USB 2.0 و 1 پورت USB 3.0 و پورت‌های HDMI، USB Type-C روی لبه‌های R565MA دیده می‌شود که با استفاده از آن‌ها می‌توان انواع ابزارهای جانبی را بدون نیاز به هیچ مبدلی به این لپ‌تاپ متصل و از آن‌ها استفاده کرد. ایسوس در کنار این امکانات متعدد، از سخت‌افزارهای خوبی هم در این محصول استفاده کرده است.`,
  },
  {
    id: "3",
    title: "لپ تاپ 13 اینچی اپل مدل MacBook Pro MYD82 2020 همراه با تاچ بار",
    category: "laptop",
    price: "۳۳,۹۶۴,۰۰۰",
    img: "/img/product-img/3.jpg",
    desc: `هم‌رده با مک بوک پرو سرسع‌تر است. با وجود اینکه MacBook Air بدون فن طراحی شده است؛ اما اپل برای MacBook Pro فن تعبیه کرده است تا بتواند برای مدت طولانی تری عملیات های سنگین را انجام دهد.مک‌بوک پرو ۱۳ اینچی از رم یکپارچه‌ی ۸ یا ۱۶ گیگابایتی بهره می‌برد و با حافظه‌ی SSD در ظرفیت‌های ۲۵۶، ۵۱۲، ۱۰۲۴ یا ۲۰۴۸ گیگابایتی به‌فروش می‌رسد. اولترابوک‌ حرفه‌ای اپل به‌ کمک باتری بزرگتر خود می‌تواند نسبت به مدل قبلی خود ۱۰ ساعت شارژ بیشتری را نگه دارد. این باتری ۵۸.۲ وات‌ساعتی‌ تا ۱۷ ساعت وب‌گردی یا ۲۰ ساعت پخش فیلم کاربر را همراهی می‌کند و با شارژر ۶۱ واتی USB-C دراختیار کاربر قرار می‌گیرد. برنامه‌نویسان به کمک آن می‌توانند با یک بار شارژ کردن دستگاه چهار ساعت بیشتر از گذشته برنامه‌نویسی کنند.دوربین مک‌بوک پرو ۱۳ اینچی همانند گذشته از وضوح ۷۲۰p بهره می‌برد؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر در داخل M1 می‌تواند تصاویری با نویز اندک و گستره‌ی دینامیکی وسیع‌تر ثبت کند. این اولترابوک ۱۳ اینچی به‌ کمک Secure Enclave تراشه‌ی M1 امنیت را ازطریق Touch ID تأمین می‌کند و مانند همتای اینتلی‌اش دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند ۱۰ گیگابیت‌برثانیه) پورت Thunderbolt 3 (پهنای باند ۴۰ گیگابیت‌برثانیه) و اتصال یک نمایشگر ۶K با نرخ ۶۰ هرتز دراختیار کاربر می‌گذارد؛ اما هم‌اکنون از سازگاری با گرافیک اکسترنال خبری نیست.مک‌بوک پرو ۱۳ اینچی کماکان از جک ۳.۵میلی‌متری هدفون بهره می‌برد و در بطن خود ماژول Wi-Fi 6 به‌همراه بلوتوث ۵ دارد.`,
  },
  {
    id: "4",
    title: "لپ تاپ 13.9 اینچی هوآوی مدل MateBook X Pro MACHC-WAE9LP - A",
    category: "laptop",
    price: "۳۹,۰۰۰,۰۰۰",
    img: "/img/product-img/4.jpg",
    desc: `لپ تاپ 13.9 اینچی هوآوی مدل MateBook X Pro MACHC-WAE9LP - A جزء سری‌های لپ‌تاپ‌های شگفت‌انگیز تولید شده توسط شرکت بزرگ و محبوب هوآوی است و در حال حاضر جدیدترین لپ تاپ 13.9 اینچ سری MateBook این شرکت در بازار محسوب می‌شود که در سال 2020 رونمایی شد. این لپ‌تاپ با تلفیقی از دانش، تجربه و فناوری طراحی شده و با سخت افزار مناسب و وزن سبک، مناسب امور روزمره، خانگی، گرافیکی نرمال، اداری و مهندسی با پردازش رو به بالا است. ضخامت این دستگاه کمتر از 14.6mm و وزن دستگاه 1.33 کیلوگرم بوده که اعدادی متوسط برای یک لپ‌تاپ 13.9 اینچی میان رده محسوب می‌شوند و ازاین حیث گزینه نسبتا مناسبی برای کسانی که حمل و نقل زیادی با دستگاه خود دارند. در این لپ تاپ از یک پردازنده ۶۴ بیتی Core i7 استفاده شده است که تمامی پردازش‌ها را تا سطح خوبی انجام می‌دهد.`,
  },

  {
    id: "5",
    title:
      "گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
    category: "SPhone",
    price: "۷,۲۷۵,۰۰۰",
    img: "/img/product-img/5.jpg",
    desc: `
گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.`,
  },

  {
    id: "6",
    title:
      "گوشی موبایل سامسونگ مدل Galaxy A32 SM-A325F/DS دو سیم‌کارت ظرفیت 128 گیگابایت و رم 6 گیگابایت",
    category: "SPhone",
    price: "۶,۳۴۹,۰۰۰",
    img: "/img/product-img/6.jpg",
    desc: `گوشی موبایل Galaxy A32 با رم 6 گیگابایتی و حافظه داخلی 128گیگابایت روانه بازار شده است. این محصول دارای صفحه‌نمایش سوپر آمولد است و ظاهر زیبایی دارد. سامسونگ تلاش کرده است حاشیه را در این تولید جدید خود تا حد امکان کم کند. این گوشی قاب پشتی از جنس پلاستیک دارد و قاب جلویی آن را شیشه پوشانده که البته جلوه‌ی زیبایی به گوشی داده است. این محصول سامسونگ با نسخه 11 از سیستم‌عامل اندروید روانه بازار شده است تا از هر نظر گوشی مدرن به‌حساب بیاید. صفحه‌نمایش استفاده‌شده در این گوشی 6.4 اینچی است که با استفاده از پنل Super AMOLED تصاویر شفاف و زنده‌ای را به نمایش می‌گذارد. این صفحه‌نمایش در هر اینچ 411 پیکسل را نشان می‌دهد. تراشه‌ی این محصول، Mediatek Helio G80 از تراشه‌های 12 نانومتری سامسونگ است که به همراه 6 گیگابایت رم عرضه می‌شود. تراشه‌ی گرافیکی Mali-G52 MC2 هم برای پخش ویدئو و بازی مناسب است. این نسخه از گوشی با حافظه 128گیگابایتی عرضه شده است و با استفاده از یک کارت حافظه‌ی جانبی قادر خواهید بود حافظه داخلی را باز هم افزایش دهید. دوربین اصلی A32 سنسور 64 مگاپیکسلی دارد و از نوع عریض (Wide) است. یک سنسور 8مگاپیکسلی و دو سنسور 5 دیگر هم در کنار این دوربین اصلی مجموعه دوربین‌های قاب پشتی A32 را تشکیل داده‌اند. دوربین سلفی 20 مگاپیکسلی هم در قاب جلویی این گوشی به کار گرفته شده است. باتری 5000 میلی‌آمپرساعتی، پشتیبانی از فناوری شارژ سریع 15 واتی، درگاه USB Type-C و حسگر اثرانگشت هم از دیگر ویژگی‌های این تازه‌وارد است. سامسونگ در ساخت این گوشی از جدیدترین فناوری‌های ساخت گوشی استفاده کرده است تا میان‌رده‌ای با باند ارتباطی مدرن و عمر طولانی باتری روانه بازار کند.`,
  },

  {
    id: "7",
    title:
      "گوشی موبایل اپل مدل iPhone 12 A2404 دو سیم‌ کارت ظرفیت 128 گیگابایت",
    category: "SPhone",
    price: "۲۵,۳۹۰,۰۰۰",
    img: "/img/product-img/7.jpg",
    desc: `گوشی موبایل «iPhone 12» پرچم‌دار جدید شرکت اپل است که با چند ویژگی جدید و دوربین دوگانه روانه بازار شده است. اپل برای ویژگی‌ها و طراحی کلی این گوشی از همان فرمول چند سال اخیرش استفاده کرده است. نمایشگر آیفون 12 به پنل Super Retina مجهز ‌شده است تا تصاویر بسیار مطلوبی را به کاربر عرضه کند. این نمایشگر رزولوشن بسیار بالایی دارد؛ به‌طوری‌که در اندازه­‌ی 6.1 اینچی‌اش، حدود 460 پیکسل را در هر اینچ جا داده است که دقیقاً با تراکم پیکسلی iPhone XS برابر است. قاب پشتی آیفون جدید هم از شیشه ساخته‌ شده تا هم گوشی مشکل آنتن‌‌دهی نداشته باشد و هم امکان شارژ بی‌‌سیم باتری در این گوشی وجود داشته باشد. البته قابی فلزی این بدنه شیشه‌ای را در خود جای داده است. این بدنه­‌ی زیبا در مقابل خط‌‌وخش مقاومت زیادی دارد؛ پس خیالتان از این بابت که آب و گردوغبار به‌‌راحتی روی آیفون 12 تأثیر نمی‌‌گذارد، راحت باشد. علاوه‌براین لکه و چربی هم روی این صفحه‌نمایش باکیفیت تأثیر چندانی ندارند اما این هم پایان کار نیست، آیفون جدید می‌تواند به مدت 30 دقیقه در عمق 6 متری آب دوام بیاورد. تشخیص چهره با استفاده از دوربین جلو دیگر ویژگی است که در آیفون جدید اپل به کار گرفته شده است. قابلیت اتصال به شبکه­‌های 4G و 5G، بلوتوث نسخه‌ 5، نسخه­‌ی 14 از iOS دیگر ویژگی‌های این گوشی هستند. ازنظر سخت‌‌افزاری هم این گوشی از تراشه­‌ی جدید A14 بهره می‌برد که تا بتواند علاوه بر کارهای معمول، از قابلیت‌های جدید واقعیت مجازی که اپل این روزها روی آن تمرکز خاصی دارد، پشتیبانی کند. به گفته خود شرکت اپل این گوشی دارای سرعتی 80 برابر نسخه 11 خود است.`,
  },

  {
    id: "8",
    title:
      "گوشی موبایل سامسونگ مدل Galaxy S20 Plus 5G SM-G986B/DS دو سیم کارت ظرفیت 128 گیگابایت",
    category: "SPhone",
    price: "۱۸,۱۳۵,۰۰۰",
    img: "/img/product-img/8.jpg",
    desc: `چندسالی است که معرفی سری محصولات بالارده «Galaxy S» در صدر اخبار مهم برای طرفداران دنیای فناوری اطلاعات قرار گرفته‌اند. گوشی موبایل «Samsung Galaxy S20 Plus» در فوریه 2020 روانه بازار شد تا ادامه دهنده راه این پرچم‌داران سامسونگ باشد. شاید مهم‌ترین تفاوت این محصول با برادر بزرگ‌ترش (Galaxy S20 Ultra) نبود سنسور پریسکوپ و باتری کمی‌ کوچکتر باشد. روکش محافظ Corning Gorilla Glass 6 این گوشی درکنار گواهینامه IP68 نشان از کیفیت ساخت بالای آن دارد. حسگر اثر انگشت این گوشی از نوع اولتراسونیک است و در زیر صفحه‌نمایش کار گذاشته شده است تا به‌‌سختی بتوان از عملکرد آن ایرادی گرفت. صفحه‌نمایشی با فناوری جدید Dynamic AMOLED 2X و تراکم پیکسلی 525 پیکسل هم با جزئیات و وضوح تصویر عالی ترجمه می‌شود. تراشه‌ی این محصول، اگزنوس 990 سامسونگ است که به‌عنوان تراشه‌ای 7 نانومتری عملکرد فوق‌العاده بهینه‌ای دارد. این تراشه که به همراه 12 گیگابایت رم عرضه می‌شود، یکی از قوی‌ترین تراشه‌های موجود در حال حاضر است و برای انجام بازی‌های سنگین و باز کردن چندین برنامه به‌صورت هم‌زمان و تماشای ویدئو کاملاً مناسب است و کم نمی‌آورد. تراشه‌ی گرافیکی Adreno 640 هم برای پخش ویدئو و بازی مناسب است. در این محصول هم دوربین قاب پشتی از چهار سنسور پرقدرت تشکیل شده است. سنسورهایی با رزولوشن 12، 64، 12 و حسگر TOF که هر آنچه از دوربین یک گوشی موبایل انتظار دارید را برآورده می‌کند. وجود درگاه USB Type-C، امکان شارژ بی‌سیم با سرعت بسیار بالا، پشتیبانی از فناوری شارژ سریع PD و باتری پرقدرت 4500 میلی‌آمپرساعتی از دیگر ویژگی‌های این پرچم‌دار سامسونگ است. این محصول خوش‌ساخت سامسونگ ازنظر ابعاد از نسخه Ultra کوچکتر و از S20 بزرگتر است اما سخت‌افزار مشابهی با برادر بزرگ‌تر خود دارد. اگر بخواهیم به سخت‌افزار گلکسی 20 اس پلاس نگاهی داشته باشیم، با یکی از دوست‌داشتنی‌ترین محصولات موجود در بازار روبرو می‌شویم که به‌نظر می‌رسد سهم قابل‌توجهی از بازار گوشی‌های بالارده را به خود اختصاص خواهد داد.`,
  },

  {
    id: "9",
    title:
      "دوربین دیجیتال کانن مدل EOS 4000D به همراه لنز 18-55 میلی متر DC III",
    category: "camera",
    price: "۹,۱۸۰,۰۰۰",
    img: "/img/product-img/9.jpg",
    desc: `این گروه یعنی EOS 2000D معرفی شد. این دوربین که در بازارهای آمریکا با نام EOS Rebel T7 شناخته می‌شود، ساده‌ترین و ارزان‌ترین دوربین DLSR (سری دوربین‌ها با لنز قابل تعویض) این شرکت است که به نظر می‌آید بیشتر از اینکه یک گام رو به جلو باشد، نوعی نوسازی مدل‌های قدیمی به شمار می‌رود. این دوربین برای کسانی است که می‌خواهند یک دوربین DSLR داشته باشند، اما قیمت آن خیلی خیلی برایشان اهمیت دارد و دوربین Canon EOS 4000D ، ارزان‌ترین گزینه موجود کانن است که حتی از دوربین پایین رده و ارزان قیمت EOS 1300D هم قیمت پایین‌تری دارد. این دوربین همه آنچه که از یک دوربین ارزان قیمت DSLR انتظار دارید (مانند حسگر بزرگ APS-C، منظره‌یاب نوری، کنترل‌ دستی نوردهی، امکان نصب فلاش‌های اکسترنال و عکاسی در آتلیه و …) را در اختیارتان می‌گذارد. اما کانن سعی کرده با استفاده از برخی امکانات ضعیف که تأثیر آن بر کیفیت دوربین چندان زیاد نیست، قیمت این دوربین را کم کند.یکی از عجیب‌ترین طراحی‌ها در این دوربین (و البته در بین دوربین‌های DSLR دیگر بازار) حذف دکمه On/Off یا همان دکمه روشن و خاموش در آن است. در این دوربین، همان دکمه‌ای که برای انتخاب Mode عکس‌برداری استفاده می‌شود، به عنوان دکمه روشن و خاموش دوربین هم به کار می‌رود. در این دوربین دکمه Dial یا همان دکمه چرخانی که انتخاب مد‌های M/Av/Tv/S را انجام می‌دهد، در نهایت، دوربین را خاموش می‌کند. بنابراین هر بار که دوربین را روشن و خاموش می‌کنید، باید دوباره، مد عکس‌برداری دوربین را انتخاب کنید.خوشبختانه، کانن در پشت دوربین سعی نکرده دکمه‌های دیگر را با هم ترکیب کند و تعداد و چیدمان آن‌ها، برای کسانی که قبلاً با دوربین‌های این شرکت کار کرده‌اند نسبتاً آشناست.`,
  },

  {
    id: "10",
    title: "دوربین دیجیتال نیکون مدل D810 به همراه لنز 24-120 میلی متر F/4G VR",
    category: "camera",
    price: "۵۳,۶۹۰,۰۰۰",
    img: "/img/product-img/10.jpg",
    desc: `
دوربین D810 نیکون جایگزین D800 و D800E است. باید بدانید که D800E در واقع از همان سنسور 36 مگاپیکسلی CMOS که در D800 به کار گرفته شده بود استفاده می‌کرد با این تفاوت که فیلتر لو پس (Low Pass) در این مدل به نحوی غیر فعال شده بود. شاید از بارزترین ویژگی‌های D810 بتوان به حذف فیلتر لو پس اشاره نمود. پردازشگر قدرتمند EXPEED 4 نیز از D4S به عاریه گرفته شده تا توانایی فراهم نمودن گستره ایزو وسیع‌تر را با کیفیت بالای عکس تضمین نماید. مکانیسم شاتر این دوربین نیز دست‌خوش تغییراتی شده و D810 از امکان شاتر الکترونیکی First-curtain بهره می‌برد تا لرزش به وجود آمده بر اثر حرکت شاتر کاهش پیدا کند و در نتیجه عکس شارپ تر به ثبت برسد. افزایش کیفیت در زمینه فیلم برداری نیز در D810 قابل توجه است. افزایش سرعت فیلم‌برداری این دوربین در حالت Full HD به 60 فریم بر ثانیه و امکان دریافت همزمان خروجی فشرده نشده تصویر از طریق درگاه HDMI از بارزترین پیشرفت‌های این دوربین در زمینه فیلم‌برداری هستند. دامنه ایزو استاندارد برای این دوربین از 64 شروع شده و تا 12800 ادامه میابد. سامانه فوکوس خودکار این دوربین نیز دارای 51 نقطه فوکوس است. شاید بزرگترین تفاوت میان D810 و مدل های پیشین همان حذف فیلتر "لو پس" است. که باعث تولید تصاویر بسیار شارپی در این دوربین شده است. البته علی رغم تلاش های نیکون با توجه به حذف این فیلتر امکان ایجاد خطای moire و رنگین کمانی در تصاویر این دوربین در هنگام عکاسی از سطوح دارای نقوش به هم فشرده یا دارای کنتراست تصویر بالا وجود دارد. نمایشگر به کار گرفته شده در D810 یک LCD 3.2 اینچی است که از نظر اندازه تفاوتی با گونه به کار گرفته شده در D800 و D800E ندارد، اما رزولوشن آن از 921 هزار نقطه به 1.23 میلیون نقطه افزایش پیدا کرده است. درکل تولید D810 از سوی نیکون به عنوان جدیدترین و پیشرفته‌ترین DSLR فول فریم از سوی این شرکت یک گام به جلو محسوب می‌شود و اینکه نیکون شهامت این را داشت که پس از حذف کامل فیلتر "لو پس" ابتدا در دوربین‌های سری DX این مهم را در دوربین‌های FX نیز اجرا کند، برای شیفتگان تکنولوژی‌های جدید روند جذابیست. نتیجه این عمل ایجاد تصاویر بهتر توام با ریسک خطای moire است.`,
  },
  {
    id: "11",
    title: "دوربین دیجیتال نیکون مدل D3500 به همراه لنز 18-55 میلی متر VR AF-P",
    category: "camera",
    price: "۱۲,۹۹۵,۰۰۰",
    img: "/img/product-img/11.jpg",
    desc: `دوربین نیکون Nikon D3500 مدل پیشرفته‌تری نسبت به مدل موفق و پرطرفدار D3400 این شرکت است. اما پیش از اینکه ببینیم چه امکاناتی به آن اضافه شده است، باید ببینیم چه شباهت‌هایی با مدل قبلی خودش دارد؟ این دوربین از همان حسگر ۲۴ مگاپیکسلی CMOS که در نسل قبلی استفاده شده بود بهره می‌برد. این حسگر که اندازه APS-C دارد و در دوربین‌های نیکون فرمت DX نامیده می‌شود، نه تنها در D3400 بلکه در بسیاری از دوربین‌های رده بالاتر، مانند D5600 و D7200 نیز استفاده شده است و کیفیت و کارآیی و محدوده وسیع Dynamic Range خود را در آن دوربین‌ها نیز به نمایش گذاشته است. جالب اینجاست که نیکون فیلتر Low-Pass را از روی این حسگر حذف کرده است تا بالاترین میزان شارپنس و جزئیات را بتوان از آن به دست آورد. این در حالی است که اغلب دوربین‌های کانن، حتی مدل‌های رده بالا، روی حسگر خود این فیلتر را دارند و به همین دلیل در مقایسه با حسگر‌های نیکون مترادف خود، شارپنس کمتری را ارائه می‌دهند. نیکون باز هم در این دوربین از پردازشگر EXPEED 4 استفاده کرده است. اگرچه این بهترین پردازنده نیکون نیست، اما دوربین نیکون Nikon D3500 می‌تواند با استفاده از آن، با سرعت ۵ فریم بر ثانیه عکاسی کند و حساسیت خود را تا ISO 25,600 بالا ببرد که برای عکاسی و فیلم‌برداری در نور کم بسیار کاربرد دارد. این پردازشگر به دوربین نیکون Nikon D3500 امکان می‌دهد تا با سرعت ۵ فریم در ثانیه هم عکاسی کند که برای یک کاربر تازه‌کار بسیار مناسب است.سیستم فوکوس ۱۱ نقطه‌ای Multi-CAM 1000 در دوربین نیکون D3500، در همان مدل قبلی یعنی D3400 هم چندان پیشرفته نبود، به همین دلیل در D3500 دیگر خیلی قدیمی محسوب می‌شود و احتمالاً نیکون با هدف پایین نگه داشتن قیمت دوربین، آن را دوباره استفاده کرده است. اما خوشبختانه حتی با همین تعداد نقاط کم، هنوز هم می‌توانید از سیستم فوکوس پیشرفته ۳D Traking اختصاصی نیکون بهره‌مند شوید که اگرچه به سرعت دوربینی مانند Nikon D500 نیست، اما برای دوربینی با این سطح قیمت واقعاً فراتر از نیاز یک عکاسی تازه‌کار است. این سیستم فوکوس می‌تواند در محدوده نوردهی از -۱ تا +۱۹ EV بدون مشکل کار کند. اما مهم‌ترین تغییر این دوربین شاید مربوط به بدنه آن باشد. دوربین نیکون Nikon D3500 حتی از دوربین کوچک و جمع و جور D3400 هم سبک‌تر و کوچک‌تر است. دوربین نیکون Nikon D3500 با وزن ۳۶۵ گرم، حدود ۱۰ درصد سبک‌تر از ۳۹۵ گرمی D3400 است. بدنه این دوربین، بسیار بیشتر از اینکه شبیه به مدل قبلی خودش باشد، شبیه به بدنه Nikon D5600 طراحی شده که با اینکه گریپ بسیار گود و خوش‌دستی دارد، حدود ۶ میلی‌متر نازک‌تر از D3400 شده است. این دوربین به همراه لنز کیت AF-P 18-55mm F3.5-5.6 که همراه آن ارائه می‌شود، آن‌قدر کوچک و سبک طراحی شده که در صورتی که بخواهید دوربینی کوچک‌تر و سبک‌تر از آن را در میان دوربین‌های نیکون پیدا کنید، احتمالاً باید سراغ دوربین‌های بدون آینه بروید. جالب اینجاست که این دوربین حتی از دوربین بدون آینه خود نیکون یعنی Z6 نیز کوچک‌تر و سبک‌تر است و جالب‌تر اینکه قدرت باطری آن تقریباً ۵ برابر باطری Nikon Z6 است! به نظر می‌رسد این تغییر بدنه، به قیمت حذف امکان پشتیبانی این دوربین از ریموت بی‌سیم ML-L3 نیکون تمام شده است. هرچند که امروزه دیگر اغلب کاربران از کنترل بی‌سیم دوربین‌ها توسط ارتباط Wi-Fi و نرم افزارهای مخصوص موبایل استفاده می‌کنند. یکی دیگر از تفاوت‌های مهم دوربین نیکون Nikon D3500 نسبت به بدنه D5600 که بیشترین شباهت را با آن دارد، نمایشگر LCD آن است. با اینکه بدنه D5600 دارای یک نمایشگر LCD بازشو است، اما نیکون D3500 همچنان از یک نمایشگر ثابت با رزولوشن ۹۲۱ هزار نقطه‌ای استفاده کرده که در کمال تعجب “غیر لمسی” هم هست. به نظر می‌رسد نیکون همچنان سعی دارد فاصله بین این دوربین و دوربین‌های رده بالاتر مانند D5600 را با عدم ارائه چنین امکاناتی حفظ کند. از آنجا که این دوربین احتمالاً به راحتی با یک دست کنترل می‌شود، نیکون تمامی دکمه‌هایی را که در مدل قبلی در سمت چپ LCD قرار داشت به سمت راست منتقل کرده است. اکنون علاوه بر دکمه‌های Lv و چهار جهته و Drive و Del، دکمه‌های Play، Menu ، Zoom in – out و i هم در زیر انگشتان دست راست قرار دارند. هرچند که طراحی قبلی برای کنترل دوربین بسیار راحت‌تر بود، اما باز هم این جابجایی به اندازه حذف دکمه Fn از سمت چپ بدنه دوربین ناراحت‌کننده‌تر نیست. در نیکون D3400 می‌توانستیم این دکمه را به قابلیت‌هایی مانند ISO که دکمه مستقیم ندارند اختصاص دهیم که در طراحی جدید بدنه، این دکمه حذف شده و جالب اینجاست که جای آن کاملاً خالی و بدون استفاده است. به عنوان یک دوربین DSLR برای تازه‌کار‌ها، خیلی هم جای تعجب نیست که برخلاف Nikon D5600، این دوربین تنها یک دکمه چرخان کنترلی دارد، اما جالب اینجاست که منظره‌یاب آن با بزرگنمایی ۰٫۸۵x از منظره‌یاب D5600 (و حتی از Z6) هم بزرگ‌تر است و می‌تواند تا ۹۵ درصد از کادر روبروی تصویر را پوشش دهد. تصاویر و ویدئو‌ها نیز می‌توانند روی یک درگاه کارت حافظه SD/SDHC/SDXC ثبت کنید و کوچک بودن بدنه امکان استفاده از کارت دوم را به دوربین نمی‌دهد. نهایتا اینکه فلاش این دوربین نیز با محدوده پوشش ۷ متر در ISO 100 به صورت بازشو طراحی شده و برای کاربری عمومی کاملا مناسب است. ضمنا در صورتیکه بخواهید از سیستم‌های نورپردازی پیشرفته یا فلاش‌های اکسترنال استفاده کنید، می‌توانید انواع ریموت کنترل‌های فلاش را روی کفشک فلاش آن قرار دهید. چیزی که درباره باطری‌های دوربین‌های رده پایین نیکون جالب است، قدرت بی‌نظیر آن‌هاست. باطری EN-EL14A با قدرت ۱۲۳۰ mAh در نیکون D3400 می‌توانست نزدیک به ۱۲۰۰ شاتر عکس بگیرد که در سطح خود بسیار عالی عمل می‌کرد. اما نیکون در مدل جدید‌تر، همان باطری را هم بهبود داده است. اکنون همان باطری در این دوربین، با نزدیک به ۳۰ درصد بهبود کارآیی، می‌تواند تا ۱۵۵۰ شات عکس بگیرد که رقم بسیار قابل توجهی است. با وجود چنین آمار خوبی، اینکه باطری این دوربین را نمی‌توانید از طریق شارژر USB شارژ کنید، اهمیت چندانی پیدا نمی‌کند.`,
  },
  {
    id: "12",
    title: "دوربین دیجیتال سونی مدل Cyber-shot DSC-W800",
    category: "camera",
    price: "۳,۶۳۰,۰۰۰",
    img: "/img/product-img/12.jpg",
    desc: `
دوربین سایبرشات جدید «W800» سونی را شاید بتوان انتخاب‌ برتر کسانی دانست که اولین دوربین خود را می‌خرند و قصد ندارند هزینه‌ی کلانی برای خرید خود پرداخت کنند. این دوربین که یک سنسور 20مگاپیکسلی از نوع Super HAD CCD دارد، به یک لنز با توانایی بزرگ‌نمایی اپتیکال 5 برابر هم مجهز شده است. سرعت شاتر این دوربین حداکثر 1/1500 ثانیه است و گستره‌ی ایزو نیز از 100 شروع می‌شود و تا 3200 ادامه دارد. شما قادر خواهید بود عکس‌ها و ویدئوهای خود را روی کارت حافظه‌ی Memory Stick Duo یا SD ذخیره کنید. یک نمایشگر 2.7 اینچی نیز با دقت 230 هزار نقطه، در پشت این دوربین قرار دارد. این دوربین 125 گرم وزن دارد و عکاسی با آن بسیار راحت و لذت‌بخش است. لنز این دوربین با فاصله‌ی کانونی 26 تا130 میلی‌متر و بزرگ‌نمایی دیجیتال 10 برابر، دارای لرزش‌گیر تصویر است. دوربین DSC-W800 با زولوشن HD و با سرعت 30 فریم بر ثانیه فیلم‌برداری می‌کند. از دیگر امکانات این دوربین می‌توان به زمانسنج خودکار 2 و 10 ثانیه، عکاسی پیاپی 0.52 فریم در ثانیه، تکنولوژی تشخیص چهره و تشخیص لبخند اشاره کرد. این دوربین در دو رنگ نقره‌ای و مشکی عرضه می‌شود.`,
  },
  {
    id: "13",
    title: "گیفت کارت استیم",
    category: "giftcard",
    img: "/img/product-img/steam-gift-card.png",
    desc: ``,
  },
  {
    id: "14",
    title: "گیفت کارت اکس باکس",
    category: "giftcard",
    img: "/img/product-img/xbox-giftcard.png",
    desc: ``,
  },
  {
    id: "15",
    title: "گیفت کارت پلی استیشین",
    category: "giftcard",
    img: "/img/product-img/playstation-giftcard.png",
    desc: ``,
  },
  {
    id: "16",
    title: "گیفت کارت اپل",
    category: "giftcard",
    img: "/img/product-img/itunes-giftcard.png",
    desc: ``,
  },
];

window.addEventListener("scroll", function () {
  const navbar = document.querySelector(".navigation");
  const scrollHeight = window.pageYOffset;
  const navHeight = navbar.getBoundingClientRect().height;
  if (scrollHeight > navHeight / 2) {
    navbar.classList.add("fixed-nav");
  } else {
    navbar.classList.remove("fixed-nav");
  }
  if (scrollHeight > 800) {
    document.querySelector(".scroll-top").classList.remove("dont-display");
  } else {
    document.querySelector(".scroll-top").classList.add("dont-display");
  }
});

const icon = document.querySelector(".scroll-top");
icon.addEventListener("click", function () {
  document.body.scrollTop = 0; // For Safari
  document.documentElement.scrollTop = 0; // For Chrome, Firefox, IE and Opera
});
document.querySelector(".menu-bar").addEventListener("click", function () {
  const navbar = document.querySelector(".navbar");
  const navHeight = navbar.getBoundingClientRect().height;
  if (navHeight === 0) {
    navbar.style.height = "144px";
  } else {
    navbar.style.height = "0";
  }
});

if (
  window.location.href ==
  "https://feanturisampleshop.herokuapp.com/"
) {
  document.addEventListener("DOMContentLoaded", function () {
    displayGiftcardCategory("giftcard");
    displaySmartphoneCategory("SPhone");
  });
}
if (
  window.location.href ==
  "https://feanturisampleshop.herokuapp.com/smart-phone"
) {
  document.addEventListener("DOMContentLoaded", function () {
    displaySmartphoneCategory("SPhone");
  });
}
if (
  window.location.href ==
  "https://feanturisampleshop.herokuapp.com/laptop"
) {
  document.addEventListener("DOMContentLoaded", function () {
    displaySmartphoneCategory("laptop");
  });
}
if (
  window.location.href ==
  "https://feanturisampleshop.herokuapp.com/giftcard"
) {
  document.addEventListener("DOMContentLoaded", function () {
    displayGiftcardCategory("giftcard");
  });
}
if (
  window.location.href ==
  "https://feanturisampleshop.herokuapp.com/camera"
) {
  document.addEventListener("DOMContentLoaded", function () {
    displaySmartphoneCategory("camera");
  });
}
// showing the products and categaorising it

function displayGiftcardCategory(category) {
  let CProducts = products.filter(function (item) {
    if (item.category == category) {
      return item;
    }
  });

  let DisProduct = CProducts.map(function (item) {
    return `<div class="card card-secondary">
            <div class="add-cart">
                <i data-id="${item.id}" class="fas fa-plus-square fa-2x"></i>
            </div>
            <img src="./static${item.img}" alt="" />
            <h2>${item.title}</h2>
            <button class="btn">
              مشاهده <i class="fas fa-chevron-left chevron"></i>
            </button>
          </div>`;
  }).join("");
  document.querySelector(".gift-container").innerHTML = DisProduct;
}
function displaySmartphoneCategory(category) {
  let CProducts = products.filter(function (item) {
    if (item.category == category) {
      return item;
    }
  });
  let DisProduct = CProducts.map(function (item) {
    return `
    <div class="card">
                <div>
                <i data-id="${item.id}" class="add-cart fas fa-plus-square fa-2x"></i>
            </div>
            <img src="./static${item.img}"/>
            <h2>${item.title}</h2>
            <h3 class="price">${item.price} تومان</h3>
          </div>
    `;
  }).join("");
  document.querySelector(".sp-container").innerHTML += DisProduct;

  document.querySelectorAll(".add-cart").forEach(function (btn) {
    btn.addEventListener("click", (e) => {
      const currentTarget = e.target.dataset.id;
      console.log(currentTarget);
      const item = products.find(function (product) {
        return product.id == currentTarget;
      });
      document.querySelector(".cart-item-container").innerHTML += `
              <div data-id="${item.id}" class="cart-list-item">
          <h3>${item.title}</h3>
          <div>
            <i class="fas fa-times fa-2x"></i>
          </div>
        </div>
      `;
      store.setlist(currentTarget);

      document.querySelectorAll(".fa-times").forEach(function (btn) {
        btn.addEventListener("click", (e) => {
          e.currentTarget.parentElement.parentElement.remove();
          const id_ = e.currentTarget.parentElement.parentElement.dataset.id;
          console.log(id_);
          store.removelist(id_);
        });
      });
    });
  });
}
// cart list
document.addEventListener("DOMContentLoaded", () => {
  UI.addToUI();
});

document.querySelector("#icon-mode").addEventListener("click", () => {
  document.querySelector(".cart").classList.toggle("show-cart");
});
document.querySelector(".cart-close-icon").addEventListener("click", () => {
  document.querySelector(".cart").classList.remove("show-cart");
});

class store {
  static getList() {
    let list;
    if (localStorage.getItem("cart") == null) {
      list = [];
    } else {
      list = JSON.parse(localStorage.getItem("cart"));
    }
    return list;
  }
  static setlist(id) {
    const list = store.getList();
    list.push(id);
    localStorage.setItem("cart", JSON.stringify(list));
  }
  static removelist(id) {
    let list = store.getList();
    for (let i = 0; i < list.length; i++) {
      if (list[i] == id) {
        list.splice(i, 1);
      }
    }
    localStorage.setItem("cart", JSON.stringify(list));
  }
}
class UI {
  static addToUI() {
    const list = store.getList();
    list.forEach((i) => {
      const item = products.find(function (product) {
        return product.id == i;
      });
      document.querySelector(".cart-item-container").innerHTML += `
              <div data-id="${item.id}" class="cart-list-item">
          <h3>${item.title}</h3>
          <div>
            <i class="fas fa-times fa-2x"></i>
          </div>
        </div>
      `;
    });

    document.querySelectorAll(".fa-times").forEach(function (btn) {
      btn.addEventListener("click", (e) => {
        e.currentTarget.parentElement.parentElement.remove();
        const id_ = e.currentTarget.parentElement.parentElement.dataset.id;
        store.removelist(id_);
      });
    });
  }
}


